# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n=int(input('Введите трехзначное число: '))

while (n > 999 or n<100 and n>-1) or (n<-999 or n>-100 and n<0):
    print('!ошибка')
    n=int(input('Введите трехзначное число: '))

if n<0:
    n=-1*n

a=n//100
b=(n-(n//100*100))//10
c=n-(n//100)*100-((n-(n//100*100))//10)*10

print(f'Сумма цифр трехзначного числа: {a+b+c}')